# 创建sqlilte数据库

<font size=4>
cmd输入命令:
    
```cmd
sqlite3 db-name
```
    
然后输入:
```cmd
.database
```
<font>

![](SQL-logic.jpg)

In [1]:
%load_ext sql

In [2]:
%sql sqlite:///sql50.db

'Connected: @sql50.db'

In [5]:
%%sql sqlite://

CREATE TABLE `Student`(
`s_id` VARCHAR(20),
`s_name` VARCHAR(20) NOT NULL DEFAULT '',
`s_birth` VARCHAR(20) NOT NULL DEFAULT '',
`s_sex` VARCHAR(10) NOT NULL DEFAULT '',
PRIMARY KEY(`s_id`)
);

Done.

[]

In [7]:
%%sql sqlite://

CREATE TABLE `Course`(
`c_id` VARCHAR(20),
`c_name` VARCHAR(20) NOT NULL DEFAULT '',
`t_id` VARCHAR(20) NOT NULL,
PRIMARY KEY(`c_id`)
);

Done.

[]

In [8]:
%%sql sqlite://

CREATE TABLE `Teacher`(
`t_id` VARCHAR(20),
`t_name` VARCHAR(20) NOT NULL DEFAULT '',
PRIMARY KEY(`t_id`)
);

Done.

[]

In [9]:
%%sql sqlite://
    
CREATE TABLE `Score`(
`s_id` VARCHAR(20),
`c_id` VARCHAR(20),
`s_score` INT(3),
PRIMARY KEY(`s_id`,`c_id`)
);

Done.

[]

In [10]:
%%sql sqlite://

insert into Student values('01' , '赵雷' , '1990-01-01' , '男');
insert into Student values('02' , '钱电' , '1990-12-21' , '男');
insert into Student values('03' , '孙风' , '1990-05-20' , '男');
insert into Student values('04' , '李云' , '1990-08-06' , '男');
insert into Student values('05' , '周梅' , '1991-12-01' , '女');
insert into Student values('06' , '吴兰' , '1992-03-01' , '女');
insert into Student values('07' , '郑竹' , '1989-07-01' , '女');
insert into Student values('08' , '王菊' , '1990-01-20' , '女');

insert into Course values('01' , '语文' , '02');
insert into Course values('02' , '数学' , '01');
insert into Course values('03' , '英语' , '03');

insert into Teacher values('01' , '张三');
insert into Teacher values('02' , '李四');
insert into Teacher values('03' , '王五');

insert into Score values('01' , '01' , 80);
insert into Score values('01' , '02' , 90);
insert into Score values('01' , '03' , 99);
insert into Score values('02' , '01' , 70);
insert into Score values('02' , '02' , 60);
insert into Score values('02' , '03' , 80);
insert into Score values('03' , '01' , 80);
insert into Score values('03' , '02' , 80);
insert into Score values('03' , '03' , 80);
insert into Score values('04' , '01' , 50);
insert into Score values('04' , '02' , 30);
insert into Score values('04' , '03' , 20);
insert into Score values('05' , '01' , 76);
insert into Score values('05' , '02' , 87);
insert into Score values('06' , '01' , 31);
insert into Score values('06' , '03' , 34);
insert into Score values('07' , '02' , 89);
insert into Score values('07' , '03' , 98);

1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [11]:
%%sql sqlite://
select * from student

Done.

[('01', '赵雷', '1990-01-01', '男'),
 ('02', '钱电', '1990-12-21', '男'),
 ('03', '孙风', '1990-05-20', '男'),
 ('04', '李云', '1990-08-06', '男'),
 ('05', '周梅', '1991-12-01', '女'),
 ('06', '吴兰', '1992-03-01', '女'),
 ('07', '郑竹', '1989-07-01', '女'),
 ('08', '王菊', '1990-01-20', '女')]

In [12]:
%%sql sqlite://
select * from course

Done.

[('01', '语文', '02'), ('02', '数学', '01'), ('03', '英语', '03')]

In [13]:
%%sql sqlite://

select * from score

Done.

[('01', '01', 80),
 ('01', '02', 90),
 ('01', '03', 99),
 ('02', '01', 70),
 ('02', '02', 60),
 ('02', '03', 80),
 ('03', '01', 80),
 ('03', '02', 80),
 ('03', '03', 80),
 ('04', '01', 50),
 ('04', '02', 30),
 ('04', '03', 20),
 ('05', '01', 76),
 ('05', '02', 87),
 ('06', '01', 31),
 ('06', '03', 34),
 ('07', '02', 89),
 ('07', '03', 98)]

In [14]:
%%sql sqlite://
select * from teacher

Done.

[('01', '张三'), ('02', '李四'), ('03', '王五')]

In [37]:
%%sql sqlite://
    
SELECT st.*,sc.s_score,c.c_id,c.c_name,t.t_id,t.t_name
FROM Student st 
INNER JOIN Score sc 
on st.s_id=sc.s_id
INNER JOIN Course c 
ON sc.c_id = c.c_id
INNER JOIN Teacher t 
ON c.t_id=t.t_id

Done.

[('01', '赵雷', '1990-01-01', '男', 80, '01', '语文', '02', '李四'),
 ('01', '赵雷', '1990-01-01', '男', 90, '02', '数学', '01', '张三'),
 ('01', '赵雷', '1990-01-01', '男', 99, '03', '英语', '03', '王五'),
 ('02', '钱电', '1990-12-21', '男', 70, '01', '语文', '02', '李四'),
 ('02', '钱电', '1990-12-21', '男', 60, '02', '数学', '01', '张三'),
 ('02', '钱电', '1990-12-21', '男', 80, '03', '英语', '03', '王五'),
 ('03', '孙风', '1990-05-20', '男', 80, '01', '语文', '02', '李四'),
 ('03', '孙风', '1990-05-20', '男', 80, '02', '数学', '01', '张三'),
 ('03', '孙风', '1990-05-20', '男', 80, '03', '英语', '03', '王五'),
 ('04', '李云', '1990-08-06', '男', 50, '01', '语文', '02', '李四'),
 ('04', '李云', '1990-08-06', '男', 30, '02', '数学', '01', '张三'),
 ('04', '李云', '1990-08-06', '男', 20, '03', '英语', '03', '王五'),
 ('05', '周梅', '1991-12-01', '女', 76, '01', '语文', '02', '李四'),
 ('05', '周梅', '1991-12-01', '女', 87, '02', '数学', '01', '张三'),
 ('06', '吴兰', '1992-03-01', '女', 31, '01', '语文', '02', '李四'),
 ('06', '吴兰', '1992-03-01', '女', 34, '03', '英语', '03', '王五'),
 ('07', '郑竹', '1989-07-01', '女', 89, '02', '数学', '01', '张三'),
 ('07', '郑竹', '1989-07-01', '女', 98, '03', '英语', '03', '王五')]

## 支持窗口函数

In [3]:
%%sql sqlite://
    
SELECT row_number()
OVER(ORDER BY s_score) row_num,s_id,s_score
FROM Score

Done.

[(1, '04', 20),
 (2, '04', 30),
 (3, '06', 31),
 (4, '06', 34),
 (5, '04', 50),
 (6, '02', 60),
 (7, '02', 70),
 (8, '05', 76),
 (9, '01', 80),
 (10, '02', 80),
 (11, '03', 80),
 (12, '03', 80),
 (13, '03', 80),
 (14, '05', 87),
 (15, '07', 89),
 (16, '01', 90),
 (17, '07', 98),
 (18, '01', 99)]

In [40]:
%%sql sqlite://
    
SELECT row_number()
OVER(
    PARTITION BY s_birth
    ORDER BY s_score
) row_num, st.s_birth,st.s_id,sc.s_score
FROM Student st 
INNER JOIN Score sc 
ON st.s_id=sc.s_id

Done.

[(1, '1989-07-01', '07', 89),
 (2, '1989-07-01', '07', 98),
 (1, '1990-01-01', '01', 80),
 (2, '1990-01-01', '01', 90),
 (3, '1990-01-01', '01', 99),
 (1, '1990-05-20', '03', 80),
 (2, '1990-05-20', '03', 80),
 (3, '1990-05-20', '03', 80),
 (1, '1990-08-06', '04', 20),
 (2, '1990-08-06', '04', 30),
 (3, '1990-08-06', '04', 50),
 (1, '1990-12-21', '02', 60),
 (2, '1990-12-21', '02', 70),
 (3, '1990-12-21', '02', 80),
 (1, '1991-12-01', '05', 76),
 (2, '1991-12-01', '05', 87),
 (1, '1992-03-01', '06', 31),
 (2, '1992-03-01', '06', 34)]

# 查询课程编号为“01”的课程比“02”的课程成绩高的所有学生的学号（重点）

In [15]:
%%sql sqlite://
SELECT a.s_id '01',st.s_name,a.s_score
FROM
(
    SELECT *
    FROM Score
    WHERE c_id='01'
) a
INNER JOIN
(
    SELECT *
    FROM Score
    WHERE c_id='02'
)b
ON a.s_id=b.s_id
INNER JOIN
Student st
ON st.s_id=a.s_id
WHERE a.s_score>b.s_score;

Done.

[('02', '钱电', 70), ('04', '李云', 50)]

In [16]:
%%sql sqlite://

SELECT st.* 
FROM Student st
INNER JOIN
(
    SELECT *
    FROM Score
    WHERE c_id='01'
) a 
ON st.s_id=a.s_id
INNER JOIN
(
    SELECT *
    FROM Score
    WHERE c_id='02'
) b 
ON a.s_id=b.s_id
WHERE a.s_score>b.s_score;

Done.

[('02', '钱电', '1990-12-21', '男'), ('04', '李云', '1990-08-06', '男')]

In [20]:
%%sql sqlite://
SELECT distinct st.*
FROM Student st 
INNER JOIN Score sc 
ON st.s_id=sc.s_id
WHERE st.s_id
IN
(
    SELECT a.s_id 
    FROM
    (
        SELECT *
        FROM Score
        WHERE c_id='01'
    ) a 
    INNER JOIN
    (
        SELECT *
        FROM Score
        WHERE c_id='02'
    ) b 
    ON a.s_id=b.s_id
    WHERE a.s_score>b.s_score
)

Done.

[('02', '钱电', '1990-12-21', '男'), ('04', '李云', '1990-08-06', '男')]

# 查询平均成绩大于60分的学生的学号和平均成绩（简单，第二道重点）

In [21]:
%%sql sqlite://
    
SELECT s_id, round(avg(s_score),2) mean_score
FROM Score sc
GROUP BY s_id
HAVING avg(s_score)>60

Done.

[('01', 89.67), ('02', 70.0), ('03', 80.0), ('05', 81.5), ('07', 93.5)]

## 反向选择

In [22]:
%%sql sqlite://

SELECT s_id,round(avg(s_score),2) mean_score
FROM Score
WHERE s_score
NOT IN
(
    SELECT s_score
    FROM Score
    GROUP BY s_id
    HAVING avg(s_score)>60
)

Done.

[('01', 59.9)]

## 包含无成绩的情况

In [23]:
%%sql sqlite://
    
SELECT s_id,round(avg(s_score),2) mean_score
FROM Score sc 
GROUP BY s_id
HAVING avg(s_score) IS NULL 
OR avg(s_score)>60

Done.

[('01', 89.67), ('02', 70.0), ('03', 80.0), ('05', 81.5), ('07', 93.5)]

In [24]:
%%sql sqlite://
    
SELECT s_id,round(avg(IFNULL(sc.s_score,0)),2) mean_score
FROM Score sc 
GROUP BY s_id
HAVING avg(s_score) IS NULL 
OR avg(s_score)>60

Done.

[('01', 89.67), ('02', 70.0), ('03', 80.0), ('05', 81.5), ('07', 93.5)]

`IFNULL()`如果第一个值为NULL，就返回第二个值，否则就返回第一个值

# 选择90年5月至91年出生的人

In [26]:
%%sql sqlite://
SELECT *
FROM Student
WHERE s_birth
BETWEEN '1990-05'
AND '1991'

Done.

[('02', '钱电', '1990-12-21', '男'),
 ('03', '孙风', '1990-05-20', '男'),
 ('04', '李云', '1990-08-06', '男')]

# 查询90年后出生的人

In [27]:
%%sql sqlite://
    
SELECT *
FROM Student
WHERE s_birth>'1990'

Done.

[('01', '赵雷', '1990-01-01', '男'),
 ('02', '钱电', '1990-12-21', '男'),
 ('03', '孙风', '1990-05-20', '男'),
 ('04', '李云', '1990-08-06', '男'),
 ('05', '周梅', '1991-12-01', '女'),
 ('06', '吴兰', '1992-03-01', '女'),
 ('08', '王菊', '1990-01-20', '女')]

# -- 查询所有学生的学号、姓名、选课数、总成绩（不重要）

In [28]:
%%sql sqlite://
    
SELECT st.*,sum(sc.s_score) total_score
FROM Student st 
INNER JOIN Score sc 
ON st.s_id=sc.s_id
GROUP BY st.s_id

Done.

[('01', '赵雷', '1990-01-01', '男', 269),
 ('02', '钱电', '1990-12-21', '男', 210),
 ('03', '孙风', '1990-05-20', '男', 240),
 ('04', '李云', '1990-08-06', '男', 100),
 ('05', '周梅', '1991-12-01', '女', 163),
 ('06', '吴兰', '1992-03-01', '女', 65),
 ('07', '郑竹', '1989-07-01', '女', 187)]

# -- 查询姓“猴”的老师的个数（不重要）

In [29]:
%%sql sqlite://
    
SELECT count(t_id)
FROM Teacher
WHERE t_name
LIKE '猴%'

Done.

[(0,)]

# 查询没学过张三老师的课程 (非常容易错)

In [32]:
%%sql sqlite://

SELECT *
FROM Student st
WHERE st.s_id
NOT IN
(
    SELECT sc.s_id
    FROM Score sc 
    INNER JOIN Course c 
    ON sc.c_id=c.c_id
    INNER JOIN Teacher t 
    ON c.t_id=t.t_id
    WHERE t.t_name='张三'
)

Done.

[('06', '吴兰', '1992-03-01', '女'), ('08', '王菊', '1990-01-20', '女')]

**错误解法**

In [33]:
%%sql sqlite://
    
SELECT *
FROM Student st
WHERE st.s_id
IN
(
    SELECT sc.s_id
    FROM Score sc 
    INNER JOIN Course c 
    ON sc.c_id=c.c_id
    INNER JOIN Teacher t 
    ON c.t_id=t.t_id
    WHERE t.t_name!='张三'
);

Done.

[('01', '赵雷', '1990-01-01', '男'),
 ('02', '钱电', '1990-12-21', '男'),
 ('03', '孙风', '1990-05-20', '男'),
 ('04', '李云', '1990-08-06', '男'),
 ('05', '周梅', '1991-12-01', '女'),
 ('06', '吴兰', '1992-03-01', '女'),
 ('07', '郑竹', '1989-07-01', '女')]

**错误原因**

先选择全部数据表

In [35]:
%%sql sqlite://
    
SELECT st.*,sc.s_score,c.c_id,t.t_id,t.t_name
FROM Student st 
INNER JOIN Score sc 
on st.s_id=sc.s_id
INNER JOIN Course c 
ON sc.c_id = c.c_id
INNER JOIN Teacher t 
ON c.t_id=t.t_id

Done.

[('01', '赵雷', '1990-01-01', '男', 80, '01', '02', '李四'),
 ('01', '赵雷', '1990-01-01', '男', 90, '02', '01', '张三'),
 ('01', '赵雷', '1990-01-01', '男', 99, '03', '03', '王五'),
 ('02', '钱电', '1990-12-21', '男', 70, '01', '02', '李四'),
 ('02', '钱电', '1990-12-21', '男', 60, '02', '01', '张三'),
 ('02', '钱电', '1990-12-21', '男', 80, '03', '03', '王五'),
 ('03', '孙风', '1990-05-20', '男', 80, '01', '02', '李四'),
 ('03', '孙风', '1990-05-20', '男', 80, '02', '01', '张三'),
 ('03', '孙风', '1990-05-20', '男', 80, '03', '03', '王五'),
 ('04', '李云', '1990-08-06', '男', 50, '01', '02', '李四'),
 ('04', '李云', '1990-08-06', '男', 30, '02', '01', '张三'),
 ('04', '李云', '1990-08-06', '男', 20, '03', '03', '王五'),
 ('05', '周梅', '1991-12-01', '女', 76, '01', '02', '李四'),
 ('05', '周梅', '1991-12-01', '女', 87, '02', '01', '张三'),
 ('06', '吴兰', '1992-03-01', '女', 31, '01', '02', '李四'),
 ('06', '吴兰', '1992-03-01', '女', 34, '03', '03', '王五'),
 ('07', '郑竹', '1989-07-01', '女', 89, '02', '01', '张三'),
 ('07', '郑竹', '1989-07-01', '女', 98, '03', '03', '王五')]

In [36]:
%%sql sqlite://
    
SELECT st.*,sc.s_score,c.c_id,t.t_id,t.t_name
FROM Student st 
INNER JOIN Score sc 
on st.s_id=sc.s_id
INNER JOIN Course c 
ON sc.c_id = c.c_id
INNER JOIN Teacher t 
ON c.t_id=t.t_id
WHERE t.t_name!='张三'

Done.

[('01', '赵雷', '1990-01-01', '男', 80, '01', '02', '李四'),
 ('01', '赵雷', '1990-01-01', '男', 99, '03', '03', '王五'),
 ('02', '钱电', '1990-12-21', '男', 70, '01', '02', '李四'),
 ('02', '钱电', '1990-12-21', '男', 80, '03', '03', '王五'),
 ('03', '孙风', '1990-05-20', '男', 80, '01', '02', '李四'),
 ('03', '孙风', '1990-05-20', '男', 80, '03', '03', '王五'),
 ('04', '李云', '1990-08-06', '男', 50, '01', '02', '李四'),
 ('04', '李云', '1990-08-06', '男', 20, '03', '03', '王五'),
 ('05', '周梅', '1991-12-01', '女', 76, '01', '02', '李四'),
 ('06', '吴兰', '1992-03-01', '女', 31, '01', '02', '李四'),
 ('06', '吴兰', '1992-03-01', '女', 34, '03', '03', '王五'),
 ('07', '郑竹', '1989-07-01', '女', 98, '03', '03', '王五')]

这一种查询方法仅仅是把`t_name!=张三`这一部分排除了，仍然查找出另外两个老师，对应的学生

In [41]:
%%sql sqlite://
    
SELECT *
FROM Student st 
INNER JOIN Score sc 
ON st.s_id=sc.s_id
INNER JOIN Course c 
ON sc.c_id=c.c_id
INNER JOIN Teacher t 
ON t.t_id=c.t_id
WHERE t.t_name='张三'

Done.

[('01', '赵雷', '1990-01-01', '男', '01', '02', 90, '02', '数学', '01', '01', '张三'),
 ('02', '钱电', '1990-12-21', '男', '02', '02', 60, '02', '数学', '01', '01', '张三'),
 ('03', '孙风', '1990-05-20', '男', '03', '02', 80, '02', '数学', '01', '01', '张三'),
 ('04', '李云', '1990-08-06', '男', '04', '02', 30, '02', '数学', '01', '01', '张三'),
 ('05', '周梅', '1991-12-01', '女', '05', '02', 87, '02', '数学', '01', '01', '张三'),
 ('07', '郑竹', '1989-07-01', '女', '07', '02', 89, '02', '数学', '01', '01', '张三')]

# 查询学过编号为“01”的课程并且也学过编号为“02”的课程的学生的学号、姓名（重点）

In [15]:
%%sql sqlite://
SELECT * 
FROM Student st
WHERE st.s_id
IN
(
    SELECT a.s_id
    FROM
    (
        SELECT *
        FROM Score sc 
        WHERE sc.c_id='01'
    ) a 
    INNER JOIN
    (
        SELECT *
        FROM Score sc 
        WHERE sc.c_id='02'
    ) b 
    ON a.s_id=b.s_id
)

Done.

[('01', '赵雷', '1990-01-01', '男'),
 ('02', '钱电', '1990-12-21', '男'),
 ('03', '孙风', '1990-05-20', '男'),
 ('04', '李云', '1990-08-06', '男'),
 ('05', '周梅', '1991-12-01', '女')]

In [16]:
%%sql sqlite://
    
    SELECT a.s_id,a.c_id,b.c_id
    FROM
    (
        SELECT *
        FROM Score sc 
        WHERE sc.c_id='01'
    ) a 
    INNER JOIN
    (
        SELECT *
        FROM Score sc 
        WHERE sc.c_id='02'
    ) b 
    ON a.s_id=b.s_id

Done.

[('01', '01', '02'),
 ('02', '01', '02'),
 ('03', '01', '02'),
 ('04', '01', '02'),
 ('05', '01', '02')]

In [17]:
%%sql sqlite://
    
SELECT a.s_id,a.c_id,b.c_id
FROM
(
    SELECT *
    FROM Score sc 
    WHERE sc.c_id='01'
) a 
INNER JOIN
(
    SELECT *
    FROM Score sc 
    WHERE sc.c_id='02'
) b 
ON a.s_id=b.s_id

Done.

[('01', '01', '02'),
 ('02', '01', '02'),
 ('03', '01', '02'),
 ('04', '01', '02'),
 ('05', '01', '02')]

# 查询学过编号为“01”的课程但没有学过编号为“02”的课程的学生的学号、姓名（重点）

In [10]:
%%sql sqlite://

SELECT *
FROM Student st 
WHERE st.s_id
IN
(
    SELECT s_id
    FROM Score sc 
    WHERE sc.c_id='01'
)
AND st.s_id NOT IN
(
    SELECT s_id
    FROM Score sc 
    WHERE sc.c_id='02'
)

Done.

[('06', '吴兰', '1992-03-01', '女')]

# -- 查询课程编号为“02”的总成绩（不重点）

In [4]:
%%sql sqlite://
SELECT sum(s_score)
FROM Score
GROUP BY c_id
HAVING c_id='02'

Done.

[(436,)]

# 查询所有课程成绩小于60分的学生的学号、姓名

1. 查询所有小于60分的课程
2. 统计学生共选了几门课
3. 小于60分的课程==所有学过的课程

In [6]:
%%sql sqlite://
    
SELECT st.*
FROM
(
    SELECT s_id,count(c_id) cnt 
    FROM Score
    WHERE s_score<60
    GROUP BY s_id
)a
INNER JOIN 
(
    SELECT s_id,count(c_id) cnt 
    FROM Score
    GROUP BY s_id

) b
ON a.s_id=b.s_id
INNER JOIN Student st 
ON st.s_id=a.s_id
WHERE a.cnt=b.cnt

Done.

[('04', '李云', '1990-08-06', '男'), ('06', '吴兰', '1992-03-01', '女')]

In [5]:
%%sql sqlite:// 
SELECT st.*
FROM Student st 
INNER JOIN Score sc 
ON st.s_id=sc.s_id
GROUP BY st.s_id
HAVING max(sc.s_score)<60

Done.

[('04', '李云', '1990-08-06', '男'), ('06', '吴兰', '1992-03-01', '女')]

# 查询没有学全所有课的学生的学号、姓名(重点)

In [7]:
%%sql sqlite://
    
SELECT st.*,sc.*,c.*
FROM Course c
INNER JOIN Score sc 
ON sc.c_id=c.c_id
INNER JOIN Student st 
ON st.s_id=sc.s_id
GROUP BY sc.s_id
HAVING count(sc.c_id)<
(
    SELECT count(DISTINCT c_id)
    FROM Course
)

Done.

[('05', '周梅', '1991-12-01', '女', '05', '01', 76, '01', '语文', '02'),
 ('06', '吴兰', '1992-03-01', '女', '06', '01', 31, '01', '语文', '02'),
 ('07', '郑竹', '1989-07-01', '女', '07', '02', 89, '02', '数学', '01')]

# 查询至少有一门课与学号为“01”的学生所学课程相同的学生的学号和姓名（重点）

In [8]:
%%sql sqlite://
    
SELECT DISTINCT st.*
FROM Student st 
INNER JOIN Score sc 
ON st.s_id = sc.s_id
WHERE sc.c_id IN
(
    SELECT c_id 
    FROM Score
    WHERE s_id='01'
)
AND st.s_id!='01'

Done.

[('02', '钱电', '1990-12-21', '男'),
 ('03', '孙风', '1990-05-20', '男'),
 ('04', '李云', '1990-08-06', '男'),
 ('05', '周梅', '1991-12-01', '女'),
 ('06', '吴兰', '1992-03-01', '女'),
 ('07', '郑竹', '1989-07-01', '女')]

# 查询和“01”号同学所学课程完全相同的其他同学的学号(重点)

In [9]:
%%sql sqlite://
    
SELECT st.*
FROM Student st 
INNER JOIN Score sc 
ON st.s_id=sc.s_id
GROUP BY st.s_id
HAVING count(c_id) IN
(
    SELECT count(c_id)
    FROM Score 
    WHERE s_id='01'
)
AND sc.s_id !='01'

Done.

[('02', '钱电', '1990-12-21', '男'),
 ('03', '孙风', '1990-05-20', '男'),
 ('04', '李云', '1990-08-06', '男')]

# 查询没学过"张三"老师讲授的任一门课程的学生姓名 和47题一样（重点，能做出来）

In [10]:
%%sql sqlite://
    
    
SELECT st.*
FROM Student st 
WHERE st.s_id NOT IN
(
    SELECT sc.s_id
    FROM Score sc 
    INNER JOIN Course c 
    ON sc.c_id=c.c_id
    INNER JOIN Teacher t 
    ON t.t_id=c.t_id
    WHERE t_name='张三'
)

Done.

[('06', '吴兰', '1992-03-01', '女'), ('08', '王菊', '1990-01-20', '女')]

# 查询两门及其以上不及格课程的同学的学号，姓名及其平均成绩（重点）

In [11]:
%%sql sqlite:// 
    
SELECT st.*, avg(sc.s_score)
FROM Score sc
INNER JOIN Student st 
ON st.s_id=sc.s_id
WHERE s_score<60
GROUP BY sc.s_id
HAVING count(c_id)>=2

Done.

[('04', '李云', '1990-08-06', '男', 33.333333333333336),
 ('06', '吴兰', '1992-03-01', '女', 32.5)]

# 检索"01"课程分数小于60，按分数降序排列的学生信息（和34题重复，不重点）

In [14]:
%%sql sqlite:// 
    
SELECT s_id,sc.s_score,sc.c_id
FROM Score sc 
WHERE sc.c_id='01'
AND sc.s_score<60

Done.

[('04', 50, '01'), ('06', 31, '01')]

# 按平均成绩从高到低显示所有学生的所有课程的成绩以及平均成绩(重重点与35一样)

In [5]:
%%sql sqlite://
    
SELECT sc.s_id,round(avg(s_score),2) mean_score
FROM Score sc 
GROUP BY sc.s_id
ORDER BY avg(sc.s_score) DESC

Done.

[('07', 93.5),
 ('01', 89.67),
 ('05', 81.5),
 ('03', 80.0),
 ('02', 70.0),
 ('04', 33.33),
 ('06', 32.5)]

# 查询各科成绩最高分、最低分和平均分：以如下形式显示：课程ID，课程name，最高分，最低分，平均分，及格率，中等率，优良率，优秀率

In [4]:
%%sql sqlite://
    
SELECT c_id, 
max(s_score) max_score,
min(s_score) min_score,
round(avg(s_score),2) mean_score,
round(avg(CASE WHEN s_score>=60 THEN 1.0 ELSE 0 END),2) '>60',
round(avg(CASE WHEN s_score>=70 AND s_score<80 THEN 1.0 ELSE 0 END),2) '70~80',
round(avg(CASE WHEN s_score>=80 AND s_score<90 THEN 1.0 ELSE 0 END),2) '80~90',
round(avg(CASE WHEN s_score>=90 THEN 1.0 ELSE 0 END),2) '>90'
FROM Score
GROUP BY c_id

Done.

[('01', 80, 31, 64.5, 0.67, 0.33, 0.33, 0.0),
 ('02', 90, 30, 72.67, 0.83, 0.0, 0.5, 0.17),
 ('03', 99, 20, 68.5, 0.67, 0.0, 0.33, 0.33)]

# 按各科成绩进行排序，并显示排名(重点row_number)

In [6]:
%%sql sqlite://
    
SELECT s_id,c_id,s_score,
row_number() OVER(ORDER BY s_score DESC) ranking
FROM Score

Done.

[('01', '03', 99, 1),
 ('07', '03', 98, 2),
 ('01', '02', 90, 3),
 ('07', '02', 89, 4),
 ('05', '02', 87, 5),
 ('01', '01', 80, 6),
 ('02', '03', 80, 7),
 ('03', '01', 80, 8),
 ('03', '02', 80, 9),
 ('03', '03', 80, 10),
 ('05', '01', 76, 11),
 ('02', '01', 70, 12),
 ('02', '02', 60, 13),
 ('04', '01', 50, 14),
 ('06', '03', 34, 15),
 ('06', '01', 31, 16),
 ('04', '02', 30, 17),
 ('04', '03', 20, 18)]

# -- 查询学生的总成绩并进行排名（不重点）

In [8]:
%%sql sqlite://
    
SELECT s_id,sum(s_score) sum_score
FROM Score sc 
GROUP BY s_id
ORDER BY sum(s_score)  DESC

Done.

[('01', 269),
 ('03', 240),
 ('02', 210),
 ('07', 187),
 ('05', 163),
 ('04', 100),
 ('06', 65)]

# 查询不同老师所教不同课程平均分从高到低显示(不重点)

In [9]:
%%sql sqlite://
    
SELECT t_name, round(avg(sc.s_score),2) mean_score
FROM Teacher t 
INNER JOIN Course c 
ON t.t_id=c.c_id
INNER JOIN Score sc 
ON sc.c_id=c.c_id
GROUP BY t_name
ORDER BY avg(sc.s_score) DESC

Done.

[('李四', 72.67), ('王五', 68.5), ('张三', 64.5)]

# 查询所有课程的成绩第2名到第3名的学生信息及该课程成绩（重要 25类似）

In [10]:
%%sql sqlite://
    
SELECT st.*,c_id,s_score,
row_number() OVER 
(
    PARTITION BY c_id 
    ORDER BY s_score DESC
) m
FROM Score sc 
INNER JOIN Student st 
ON sc.s_id=st.s_id

Done.

[('01', '赵雷', '1990-01-01', '男', '01', 80, 1),
 ('03', '孙风', '1990-05-20', '男', '01', 80, 2),
 ('05', '周梅', '1991-12-01', '女', '01', 76, 3),
 ('02', '钱电', '1990-12-21', '男', '01', 70, 4),
 ('04', '李云', '1990-08-06', '男', '01', 50, 5),
 ('06', '吴兰', '1992-03-01', '女', '01', 31, 6),
 ('01', '赵雷', '1990-01-01', '男', '02', 90, 1),
 ('07', '郑竹', '1989-07-01', '女', '02', 89, 2),
 ('05', '周梅', '1991-12-01', '女', '02', 87, 3),
 ('03', '孙风', '1990-05-20', '男', '02', 80, 4),
 ('02', '钱电', '1990-12-21', '男', '02', 60, 5),
 ('04', '李云', '1990-08-06', '男', '02', 30, 6),
 ('01', '赵雷', '1990-01-01', '男', '03', 99, 1),
 ('07', '郑竹', '1989-07-01', '女', '03', 98, 2),
 ('02', '钱电', '1990-12-21', '男', '03', 80, 3),
 ('03', '孙风', '1990-05-20', '男', '03', 80, 4),
 ('06', '吴兰', '1992-03-01', '女', '03', 34, 5),
 ('04', '李云', '1990-08-06', '男', '03', 20, 6)]

## `row_number`用法

<font size=4>`row_number() over(partition by col1 order by col2)` 根据COL1分组可能会有多个组，每组组内根据COL2进行排序。每组内都有自动生成的序号，从1开始，有多少个分组就有多少个从1开始的序号</font>

In [11]:
%%sql sqlite://
    
SELECT *
FROM 
(
    SELECT st.*,c_id,s_score,
    row_number() OVER 
    (
        PARTITION BY c_id 
        ORDER BY s_score DESC
    ) m
    FROM Score sc 
    INNER JOIN Student st 
    ON sc.s_id=st.s_id
) a 
WHERE m IN (2,3)

Done.

[('03', '孙风', '1990-05-20', '男', '01', 80, 2),
 ('05', '周梅', '1991-12-01', '女', '01', 76, 3),
 ('07', '郑竹', '1989-07-01', '女', '02', 89, 2),
 ('05', '周梅', '1991-12-01', '女', '02', 87, 3),
 ('07', '郑竹', '1989-07-01', '女', '03', 98, 2),
 ('02', '钱电', '1990-12-21', '男', '03', 80, 3)]

# 使用分段[100-85],[85-70],[70-60],[<60]来统计各科成绩，分别统计各分数段人数：课程ID和课程名称(重点和18题类似)

In [5]:
%%sql sqlite://
    
SELECT c_id,max(s_score) max_score,
min(s_score)min_score,round(avg(s_score),2) mean,
round(avg(CASE WHEN s_score<60 THEN 1 ELSE 0 END),2)'不及格率',
count(CASE WHEN s_score<60 THEN 1 ELSE NULL END)'不及格人数',
round(avg(CASE WHEN s_score>=60 AND s_score<70 THEN 1 ELSE 0 END),2)'及格率',
count(CASE WHEN s_score>=60 AND s_score<70 THEN 1 ELSE NULL END)'及格人数',
round(avg(CASE WHEN s_score>=70 AND s_score<85 THEN 1 ELSE NULL END),2)'良好率',
count(CASE WHEN s_score>=70 AND s_score<85 THEN 1 ELSE NULL END)'良好人数',
round(avg(CASE WHEN s_score>=85 THEN 1 ELSE 0 END),2)'优秀率',
count(CASE WHEN s_score>=85 THEN 1 ELSE NULL END)'优秀人数'
FROM Score
GROUP BY c_id

Done.

[('01', 80, 31, 64.5, 0.33, 2, 0.0, 0, 1.0, 4, 0.0, 0),
 ('02', 90, 30, 72.67, 0.17, 1, 0.17, 1, 1.0, 1, 0.5, 3),
 ('03', 99, 20, 68.5, 0.33, 2, 0.0, 0, 1.0, 2, 0.33, 2)]

# 查询学生平均成绩及其名次

In [13]:
%%sql sqlite://
    
SELECT st.*,
row_number()OVER
(
    ORDER BY avg(sc.s_score) DESC
) ranking,
round(avg(sc.s_score),2) mean
FROM Student st 
INNER JOIN Score sc 
ON st.s_id=sc.s_id
GROUP BY st.s_id

Done.

[('07', '郑竹', '1989-07-01', '女', 1, 93.5),
 ('01', '赵雷', '1990-01-01', '男', 2, 89.67),
 ('05', '周梅', '1991-12-01', '女', 3, 81.5),
 ('03', '孙风', '1990-05-20', '男', 4, 80.0),
 ('02', '钱电', '1990-12-21', '男', 5, 70.0),
 ('04', '李云', '1990-08-06', '男', 6, 33.33),
 ('06', '吴兰', '1992-03-01', '女', 7, 32.5)]

# 查询各科成绩前三名的记录（不考虑成绩并列情况）

In [14]:
%%sql sqlite:// 
    
SELECT c_id,s_score,
(CASE WHEN m=1 THEN s_score ELSE NULL END) '1st',
(CASE WHEN m=2 THEN s_score ELSE NULL END) '2nd',
(CASE WHEN m=3 THEN s_score ELSE NULL END) '3rd'
FROM
(
    SELECT st.*,c_id,s_score,
    row_number() OVER
    (
        PARTITION BY c_id
        ORDER BY s_score DESC
    ) m
    FROM Score sc 
    INNER JOIN Student st 
    ON sc.s_id=st.s_id
) a 
WHERE m IN (1,2,3)

Done.

[('01', 80, 80, None, None),
 ('01', 80, None, 80, None),
 ('01', 76, None, None, 76),
 ('02', 90, 90, None, None),
 ('02', 89, None, 89, None),
 ('02', 87, None, None, 87),
 ('03', 99, 99, None, None),
 ('03', 98, None, 98, None),
 ('03', 80, None, None, 80)]

<font size=4>$\uparrow$错误答案<font>
    
<font size=4>$\downarrow$正确答案<font>

In [15]:
%%sql sqlite://
    
SELECT c_id,s_score,
max(CASE WHEN m=1 THEN s_score ELSE NULL END) '1st',
max(CASE WHEN m=2 THEN s_score ELSE NULL END) '2nd',
max(CASE WHEN m=3 THEN s_score ELSE NULL END) '3rd'
FROM
(
    SELECT st.*,c_id,s_score,
    row_number() OVER
    (
        PARTITION BY c_id
        ORDER BY s_score DESC
    ) m
    FROM Score sc 
    INNER JOIN Student st 
    ON sc.s_id=st.s_id
) a 
WHERE m IN (1,2,3)
GROUP BY c_id

Done.

[('01', 76, 80, 80, 76), ('02', 87, 90, 89, 87), ('03', 80, 99, 98, 80)]

In [6]:
%%sql sqlite://
    
SELECT st.*,c_id,s_score,
row_number() OVER
(
    PARTITION BY c_id
    ORDER BY s_score DESC
) m
FROM Score sc 
INNER JOIN Student st 
ON sc.s_id=st.s_id

Done.

[('01', '赵雷', '1990-01-01', '男', '01', 80, 1),
 ('03', '孙风', '1990-05-20', '男', '01', 80, 2),
 ('05', '周梅', '1991-12-01', '女', '01', 76, 3),
 ('02', '钱电', '1990-12-21', '男', '01', 70, 4),
 ('04', '李云', '1990-08-06', '男', '01', 50, 5),
 ('06', '吴兰', '1992-03-01', '女', '01', 31, 6),
 ('01', '赵雷', '1990-01-01', '男', '02', 90, 1),
 ('07', '郑竹', '1989-07-01', '女', '02', 89, 2),
 ('05', '周梅', '1991-12-01', '女', '02', 87, 3),
 ('03', '孙风', '1990-05-20', '男', '02', 80, 4),
 ('02', '钱电', '1990-12-21', '男', '02', 60, 5),
 ('04', '李云', '1990-08-06', '男', '02', 30, 6),
 ('01', '赵雷', '1990-01-01', '男', '03', 99, 1),
 ('07', '郑竹', '1989-07-01', '女', '03', 98, 2),
 ('02', '钱电', '1990-12-21', '男', '03', 80, 3),
 ('03', '孙风', '1990-05-20', '男', '03', 80, 4),
 ('06', '吴兰', '1992-03-01', '女', '03', 34, 5),
 ('04', '李云', '1990-08-06', '男', '03', 20, 6)]

# 查询每门课程被选修的学生数

In [16]:
%%sql sqlite://
    
SELECT c_id, count(c_id)
FROM Score
GROUP BY c_id

Done.

[('01', 6), ('02', 6), ('03', 6)]

# 查询出只有两门课程的全部学生的学号和姓名(不重点)

In [19]:
%%sql sqlite://
    
SELECT st.*,count(sc.c_id) cnt
FROM Student st 
INNER JOIN Score sc 
ON st.s_id=sc.s_id
GROUP BY st.s_id
HAVING count(sc.c_id)=2

Done.

[('05', '周梅', '1991-12-01', '女', 2),
 ('06', '吴兰', '1992-03-01', '女', 2),
 ('07', '郑竹', '1989-07-01', '女', 2)]

# 查询名字中含有"风"字的学生信息（不重点）

In [20]:
%%sql sqlite://
    
SELECT s_name
FROM Student
WHERE s_name LIKE '%风%'

Done.

[('孙风',)]

# 查询1990年出生的学生名单（重点year）

In [22]:
%%sql sqlite://
    
SELECT *
FROM Student
WHERE s_birth LIKE '1990%'

Done.

[('01', '赵雷', '1990-01-01', '男'),
 ('02', '钱电', '1990-12-21', '男'),
 ('03', '孙风', '1990-05-20', '男'),
 ('04', '李云', '1990-08-06', '男'),
 ('08', '王菊', '1990-01-20', '女')]

# 查询平均成绩大于等于85的所有学生的学号、姓名和平均成绩（不重要）

In [23]:
%%sql sqlite://
    
SELECT st.*,sc.s_score
FROM Student st 
INNER JOIN Score sc 
ON st.s_id=sc.s_id
GROUP BY st.s_id
HAVING avg(sc.s_score)>=85

Done.

[('01', '赵雷', '1990-01-01', '男', 80), ('07', '郑竹', '1989-07-01', '女', 89)]

# -- 查询每门课程的平均成绩，结果按平均成绩升序排序，平均成绩相同时，按课程号降序排列

In [4]:
%%sql sqlite://
    
SELECT c_id,round(avg(s_score),2) mean
FROM Score
GROUP BY c_id
ORDER BY avg(s_score), c_id DESC

Done.

[('01', 64.5), ('03', 68.5), ('02', 72.67)]

# 查询课程名称为"数学"，且分数低于60的学生姓名和分数

In [5]:
%%sql sqlite://
    
SELECT c_name,st.*,sc.s_score
FROM Course c 
INNER JOIN Score sc 
ON c.c_id=sc.c_id
INNER JOIN Student st 
ON sc.s_id=st.s_id
WHERE c_name='数学'
AND sc.s_score<60

Done.

[('数学', '04', '李云', '1990-08-06', '男', 30)]

# 查询所有学生的课程及分数情况

In [6]:
%%sql sqlite://
    
SELECT s_id,
max(CASE WHEN c_name='语文' THEN s_score ELSE NULL END)'chinese',
max(CASE WHEN c_name='数学' THEN s_score ELSE NULL END)'math',
max(CASE WHEN c_name='英语' THEN s_score ELSE NULL END) english
FROM Score sc 
INNER JOIN Course c 
ON sc.c_id=c.c_id
GROUP BY sc.s_id

Done.

[('01', 80, 90, 99),
 ('02', 70, 60, 80),
 ('03', 80, 80, 80),
 ('04', 50, 30, 20),
 ('05', 76, 87, None),
 ('06', 31, None, 34),
 ('07', None, 89, 98)]

# 查询任何一门课程成绩在70分以上的姓名、课程名称和分数

In [7]:
%%sql sqlite://
    
SELECT st.*,c.c_name,sc.s_score
FROM Student st 
INNER JOIN Score sc 
ON st.s_id=sc.s_id
INNER JOIN Course c 
ON sc.c_id=c.c_id
WHERE sc.s_score>70

Done.

[('01', '赵雷', '1990-01-01', '男', '语文', 80),
 ('01', '赵雷', '1990-01-01', '男', '数学', 90),
 ('01', '赵雷', '1990-01-01', '男', '英语', 99),
 ('02', '钱电', '1990-12-21', '男', '英语', 80),
 ('03', '孙风', '1990-05-20', '男', '语文', 80),
 ('03', '孙风', '1990-05-20', '男', '数学', 80),
 ('03', '孙风', '1990-05-20', '男', '英语', 80),
 ('05', '周梅', '1991-12-01', '女', '语文', 76),
 ('05', '周梅', '1991-12-01', '女', '数学', 87),
 ('07', '郑竹', '1989-07-01', '女', '数学', 89),
 ('07', '郑竹', '1989-07-01', '女', '英语', 98)]

# 查询不及格的课程并按课程号从大到小排列

In [8]:
%%sql sqlite://
    
SELECT c.*,sc.s_score,sc.s_id
FROM Course c 
INNER JOIN Score sc 
ON c.c_id=sc.c_id
WHERE sc.s_score<60
ORDER BY c.c_id

Done.

[('01', '语文', '02', 50, '04'),
 ('01', '语文', '02', 31, '06'),
 ('02', '数学', '01', 30, '04'),
 ('03', '英语', '03', 20, '04'),
 ('03', '英语', '03', 34, '06')]

# 查询课程编号为03且课程成绩在80分以上的学生的学号和姓名

In [9]:
%%sql sqlite://
    
SELECT st.*,sc.s_score,sc.c_id
FROM Student st 
INNER JOIN Score sc 
ON st.s_id=sc.s_id
WHERE sc.c_id='03'
AND sc.s_score>80

Done.

[('01', '赵雷', '1990-01-01', '男', 99, '03'),
 ('07', '郑竹', '1989-07-01', '女', 98, '03')]

# 求每门课程的学生人数

In [10]:
%%sql sqlite://

SELECT sc.c_id,count(sc.c_id)
FROM Score sc 
GROUP BY sc.c_id

Done.

[('01', 6), ('02', 6), ('03', 6)]

# 查询选修“张三”老师所授课程的学生中成绩最高的学生姓名及其成绩

In [11]:
%%sql sqlite://
    
SELECT  sc.*,t.t_name
FROM Score sc 
INNER JOIN Course c 
ON sc.c_id=c.c_id
INNER JOIN Teacher t 
ON c.t_id=t.t_id
WHERE t_name='张三'
ORDER BY sc.s_score DESC
LIMIT 1

Done.

[('01', '02', 90, '张三')]

# 查询不同课程成绩相同的学生的学生编号、课程编号、学生成绩

In [13]:
%%sql sqlite://
    
SELECT DISTINCT a.s_id,a.c_id,a.s_score
FROM Score a 
INNER JOIN Score b 
ON a.s_id=b.s_id
WHERE a.s_score=b.s_score
AND a.c_id!=b.c_id

Done.

[('03', '01', 80), ('03', '02', 80), ('03', '03', 80)]

# 查询每门功成绩最好的前两名

In [14]:
%%sql sqlite://
    
SELECT c_id,s_score,
max(CASE WHEN m=1 THEN s_score ELSE NULL END) '1st',
max(CASE WHEN m=2 THEN s_score ELSE NULL END) '2nd'
FROM
(
    SELECT st.*,c_id,s_score,
    row_number() OVER
    (
        PARTITION BY c_id
        ORDER BY s_score DESC
    ) m
    FROM Score sc 
    INNER JOIN Student st 
    ON sc.s_id=st.s_id
) a 
WHERE m IN (1,2,3)
GROUP BY c_id

Done.

[('01', 80, 80, 80), ('02', 89, 90, 89), ('03', 98, 99, 98)]

# 统计每门课程的学生选修人数（超过5人的课程才统计）。要求输出课程号和选修人数，查询结果按人数降序排列，若人数相同，按课程号升序排列

In [16]:
%%sql sqlite://
    
SELECT c_id,count(c_id)
FROM Score
GROUP BY(c_id)
ORDER BY count(c_id) DESC,c_id

Done.

[('01', 6), ('02', 6), ('03', 6)]

# 检索至少选修两门课程的学生学号

In [17]:
%%sql sqlite://
    
SELECT s_id,count(c_id)
FROM Score
GROUP BY s_id
HAVING count(c_id)>=2

Done.

[('01', 3), ('02', 3), ('03', 3), ('04', 3), ('05', 2), ('06', 2), ('07', 2)]

# 查询选修了全部课程的学生信息

In [18]:
%%sql sqlite://
    
SELECT s_id,count(c_id)
FROM Score
GROUP BY s_id
HAVING count(c_id)=
(
    SELECT count(*)
    FROM Course
)

Done.

[('01', 3), ('02', 3), ('03', 3), ('04', 3)]

# 查询没学过“张三”老师讲授的任一门课程的学生姓名

In [19]:
%%sql sqlite://
    
SELECT st.*
FROM Student st 
WHERE st.s_id NOT IN
(
    SELECT s_id
    FROM Score sc
    INNER JOIN Course c 
    ON sc.c_id=c.c_id
    INNER JOIN Teacher t 
    ON c.t_id=t.t_id
    WHERE t.t_name='张三'
)

Done.

[('06', '吴兰', '1992-03-01', '女'), ('08', '王菊', '1990-01-20', '女')]

In [4]:
%%sql sqlite://
    
select datediff(s_birth)
from student

(sqlite3.OperationalError) no such function: datediff
[SQL: select datediff(s_birth)
from student]
(Background on this error at: http://sqlalche.me/e/e3q8)